[
  {
    "Abstract": "Abstract: Our Session comprises of Introduction to Docker Engine, Machine and its application through making some cool hacks. Our main aim of this session is to \"Package Once Deploy Anywhere(PODA)\". Docker simplifies software delivery by making it easy to build and share images that contain your application’s entire environment or application operating system. \n\nAgenda: DevOps is growing very rapidly these days and our workshop aim is to spread the use cases and applications of microservices practically among the student, developers, researchers and several major people in the academia. \nOur workshop involves coding and scripting and hence we will be creating everything on Github repository to test our hacks and we can also show how to create and run automated build tests. Through this workshop we are trying to provide an innovative tool of simplified dependency and faster deployments \"Docker\" which can be appreciated by people in various field of research, science and also by developers and students.\n\nParticipants: Since this would be a development workshop on Docker, so participants should come with their own laptop given that they should know the basic working commands on at least one OS such as Linux based OS, Mac or Windows and use of internet. A concrete use of the microservice platform can be shown, still without any problem related to a varying number of participants.\n\nAbout Me: I am a final year undergraduate of Computer Science and an active open source contributor to Fedora, Mozilla, KDE and Docker. I'm an intermediate hacker in Docker and a beginner in Ansible and a passionate coder.\n\nOutcome: We are interested in the Microservices and DevOps and hence this workshop could have a great impact on participants with greater understanding of how to work on Open Source project with faster deployments and sharing. I hope that participants will leave seeing contribution as a way to participate in Open Source communities, grow their skills and experience, and have fun. Having gone through the process once, it will be small bowl to do so again!\n\nNecessary Resource Link for participants: \n1. https://docs.docker.com/engine\n2. https://docs.docker.com/docker-cloud/overview/\n3. https://docs.docker.com/docker-hub/\n4. https://docs.docker.com/machine/overview/",
    "Agreement": "1",
    "Avatar": "http://en.gravatar.com/amitkumarj441",
    "Bio": "Amit Kumar Jaiswal is a final year undergraduate of Computer Science & Engineering currently pursuing Bachelor of Technology from Kanpur University. He is an active open source contributor to Mozilla and Fedora since 2015. He is a passionate coder, a quora addict, foodie and he has committed more than 50 patches to different open source Community like Mozilla(contribution link: https://goo.gl/Eb9aCS, https://goo.gl/Fp4oxX, https://goo.gl/Tey4uy), Fedora, Docker, Joomla and KDE. His Github handler : http://github.com/amitkumarj441",
    "Country": "IN",
    "Difficulty": "Intermediate",
    "Email": "amitkumarj441@gmail.com",
    "Name": "Amit Kumar Jaiswal",
    "Org": "Volunteer Contributor(https://mozillians.org/en-US/u/amitkumarj441/), Mozilla",
    "Secondary": "Sylvia Sanchez\nBackground / Bio: Designer, Translator and Technical writer, Python student, History and aviation passionated.\nOrganizational Affilation: Fedora Project\nEmail: lailahfsf@gmail.com\nTwitter: http://twitter.com/SylBlackmore\nCountry from where I'm travelling from:  Germany\nWearable size:  Female Medium",
    "Size": "Extra Large / Male",
    "Submitted": "2016-09-23 11:01:54",
    "Theme": [
      "Cloud",
      "Containers",
      "DevOps",
      "Linux",
      "Microservices"
    ],
    "Title": "Refactor applications using Docker",
    "Twitter": "http://twitter.com/amit_gkp",
    "Type": "Workshop 110m"
  },
  {
    "Abstract": "Linux kernel Namespaces have been around since the mount namespace was introduced over a decade ago and the Linux audit secure logging subsystem was introduced a couple of years later.\n\nSince then, audit's relationship with namespaces has evolved to restrict everything to PID and user initial namespaces for reporting integrity reasons, but then start to loosen things up again, first listening in all network namespaces, then permitting user audit message writes from any PID namespace.\n\nLooking forward, audit will need to run in containers, possibly for distributions, but more likely for docker micro-services to meet new certification requirements.  Anchoring the audit daemon in the user namespace with its own rulespace and queue looks to make the most sense.  Since the kernel has no concept of containers, identifying namespaces in audit messages will equip tracking tools to follow process events in containers.\n\nAudience:\nThe audience is developers interested in kernel security infrastructure and Linux namespaces, and architects of higher level services that are looking forward at how containers may work their way into security certified environments for clients needing such a combination. Attendees can expect some detailed history of the interaction of audit and namespaces and some ideas of how to get audit and containers to work together, and how to potentially manage audit information for containers migrating hosts.\n\nCommunity Benefit:\nThis presentation will bring the community up to date of the current state of audit and namespaces, bring some ideas to the community of what challenges we face to keep pace with competing lightweight virtual system and container solutions for secured and certified environments from other operating system environments and how we might solve them, soliciting ideas from the audience of other aspects to consider.",
    "Agreement": "1",
    "Avatar": "http://www.credil.org/system/files/Photo_maker_Richard-Briggs.jpg",
    "Bio": "Richard was an early adopter of Linux, having used it since 1992. He was also a founding board member of Ottawa Canada Linux Users Group and a speaker at the inaugural Ottawa Linux Symposium. Richard has written UNIX and Linux device drivers for telecom, video and network\napplications and embedded devices, having a good knowledge of IPsec protocols.  He is comfortable in C, bash, Perl, with a soldering iron,\noscilloscope, at a podium or chalkboard. He is now a Red Hat kernel security engineer.",
    "Country": "CA",
    "Difficulty": "Advanced",
    "Email": "rgb@tricolour.ca",
    "Name": "Richard Guy Briggs",
    "Org": "Red Hat",
    "Secondary": "-",
    "Size": "Medium / Male",
    "Submitted": "2016-09-23 01:24:08",
    "Theme": [
      "Containers",
      "Enterprise Security",
      "Identity Management",
      "Linux"
    ],
    "Title": "Audit and Namespaces, looking toward Containers",
    "Twitter": "-",
    "Type": "Talk 40m+10m"
  }
]